Revit 2026 API
CurveByPointsUtils Methods
The CurveByPointsUtils type exposes the following members.
Methods
Name | Description
AddCurvesToFaceRegion
CreateArcThroughPoints |  Creates an arc through the given reference points.
CreateRectangle
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetFaceRegions |  Gets the FaceRegions in the existing face.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetHostFace |  Gets the host face to which the CurveElement is added.
GetProjectionType |  Gets the projection type of the CurveElement.
GetSketchOnSurface |  Gets the relationship between the CurveElement and face.
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetProjectionType |  Sets the projection type of the CurveElement.
SetSketchOnSurface |  Sets the relationship between the CurveElement and face.
ToString | Returns a string that represents the current object.
(Inherited from Object)
ValidateCurveElementIdArrayForFaceRegions
Top
See Also
Reference
CurveByPointsUtils Class
Autodesk.Revit.DB Namespace